import React from 'react'
import type { NextPage } from 'next'
import Head from 'next/head'
import { useRouter } from 'next/router'

const HistoryPage: NextPage = () => {
  return (
    <div className='pt-16'>
      <Head>
        <title>इतिहास - पौडेल परिवार</title>
      </Head>

      <div className="container">
        <h1 className='text-5xl mb-16'>इतिहास</h1>

        <div className="history text-2xl font-Mukta text-justify">
          <p className='mb-8'>
            पौडल वंश नेपालको प्राचीन ऋषिवंशबाट विकसित भएको वंश हो । महर्षि आत्रेयका सन्तति अर्चनानस, श्यावाश्व हुँदै आत्रेय पुनर्वसु इ.पू ६०० पतञ्जली – चरक) आत्रेय इ. पू. १५० सम्म इशा पूर्वको इतिहास विकास भएको छ भने इ सं ४६३ सोमनाथ आत्रेयबाट उदय भट्ट (दशौ शताब्दी) चाबा, सदु (१३ औं शताब्दी) हुँदै विकास भएर आज सम्मको वंश विकासको इतिहास यस वंशको प्रमाणिक आधार रही आएको छ । विक्रमको १२ औं शताब्दीमा पौडी गढवाल निवासी प्रसिद्ध विद्वान् वत्सराज भट्टलाई आफ्नो वाजपेय यज्ञ सम्पादन गर्न तत्कालीन डोटी पार्वत्य राज्यका राजा राधा माधव सेनले यज्ञका प्रमुख आचार्य बनाई यज्ञ सम्पन्न गर्दा उनमा वैराग्य उत्पन्न भई सम्पूर्ण राजपाठ सहित आफ्नी एक मात्र छोरी शुभकन्या वत्सराजलाई दान दिई आफू काशीवासका लागि गए पछि, त्यहाँ पौडीबाट आएका वत्सराजको वंश विस्तार हुँदै गयो । पौडी गढवालबाट आएका हुनाले यिनको वंश – पौडी+ आलय ) पौडयालय कहलिन थाल्यो । कालान्तरमा पौडयालयबाट पौडयाल र पौडेल थरको विकास भएको पाइन्छ ।
          </p>


          <p className='mb-8'>
            नेपालमा पौडेलवंशका जात जातिहरुको संख्या करिव २१ लाख छ । पहिले यिनीहरुको पुर्खा नेपालका पुराना वाइसी चौविसी राज्यहरुमा राजगुरुका रुपमा सम्मानित थिए । त्यसैले हरेक थुमे राज्यहरुमा पौडेलहरुको विस्तार हुन पुगेको अनुमान छ । पौडेलहरु बाहुन, क्षेत्रीका अतिरिक्त अनेक जात र वर्गमा विभाजित छन् । तर पनि पौडेलहरुको एउटै गोत्र आत्रेय र प्रवर पनि आत्रेय, अर्चनाना, श्यावाश्व त्रिप्रवर नै हो । अनेक जात जातिमा विभक्त पौडेलहरु अहिले विश्वका १२७ मुलुकहरुमा पुगेका छन् । उनीहरुको आफ्नो पुरानो इतिहासलाई बिर्सेर आफ्नो पेशा, व्यवसाय गरेर त्यहाँ बसेका छन् । कतिपय पौडेलहरु आफ्नो थर नै बिर्सेर पनि बसेका छन् ।
          </p>


          <p className='mb-8'>
            अहिले पौडेलहरु नेपालको हरेक क्षेत्रमा छन् । नेपालका दोस्रा प्रधानमन्त्री मुख्तियार रङ्गनाथ पौडयाल, कवि शिरोमणि लेखनाथ पौडयाल, लक्ष्मीधर फलाहारी, पं. जयमंङ्गल पौडेल, पण्डित राज ब्रजनाथ पौडेल, विद्यापति पौडेल, आदि यस्ता नामहरु हुन जो पौडेल वंशको कुलदीपकका रुपमा प्रकाशमान छन् । वर्तमान समयमा नेपाल र नेपालीको श्रीवृद्धिको लागि पौडेलहरु शिक्षा, विज्ञान, संस्कृति, धर्म, दर्शन, राजनीति, समाजसेवा लगायत हरेक क्षेत्रमा सेवारत छन् । संसारभर छरिएर रहेका पौडेलहरुलाई एकताको सूत्रमा बाध्ने तथा उनीहरुलाई आफनो परिचय र वंंशबारे जानकारी गराउने उद्देश्यले यो सूचना मूलक वेबसाइट खोलिएको हो । यसबाट पौडेल बन्धुहरुका अतिरिक्त हाम्रो बारेमा जानकारी लिन जिज्ञासु अन्वेषक र अन्य महानुभावहरु पनि लाभान्वित हुनुहुनेछ भन्ने हामीले विश्वास लिएका छौं ।
          </p>

          <p className='mb-8'>
            Source: <a href="http://paudelbamsha.org.np/" className='underline text-blue-500 italic' target="_blank" rel="noopener noreferrer">http://paudelbamsha.org.np/</a>
          </p>

          <p className="mb-8">
            व्यक्तिगत ऐतिहासिक जानकारी लागि थप अनुसन्धान भइरहेको छ ...
          </p>
        </div>
      </div>

    </div>
  )
}

export default HistoryPage
